Catalogs/МегаЛогист_Маркеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>МегаЛогист_Маркеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркер1</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркер2</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркер3</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТССОреолом</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПешийКурьер</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПешийСОреолом</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветПолиЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МегаЛогист_Маркеры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьИзображение();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображение()	
		
	АдресМаркер1=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Маркер1");
	АдресМаркер2=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Маркер2");
	АдресМаркер3=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Маркер3");
	АдресМаркер4=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ТССОреолом");
	АдресМаркер5=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ПешийКурьер");
	АдресМаркер6=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ПешийСОреолом");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзображение(АдресМаркера)	
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ВыборФайла = Новый ДиалогВыбораФайла(Режим);
	ВыборФайла.Фильтр = НоменклатураКлиент.ФильтрФайловИзображений();
	
	ВыборФайла.Выбрать();
	Если ВыборФайла.ВыбранныеФайлы.Количество() > 0 Тогда
		
		ИмяФайла = ВыборФайла.ВыбранныеФайлы[0];				
		ОбъектФайл = Новый Файл(ИмяФайла);				
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
		АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
		АдресМаркера = АдресФайлаВХранилище;
		
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура АдресМаркер1Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗагрузитьИзображение(АдресМаркер1);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресМаркер2Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗагрузитьИзображение(АдресМаркер2);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресМаркер1) Тогда
		ТекущийОбъект.Маркер1=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресМаркер1));
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресМаркер2) Тогда
		ТекущийОбъект.Маркер2=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресМаркер2));
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресМаркер3) Тогда
		ТекущийОбъект.Маркер3=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресМаркер3));
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресМаркер4) Тогда
		ТекущийОбъект.ТССОреолом=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресМаркер4));
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресМаркер5) Тогда
		ТекущийОбъект.ПешийКурьер=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресМаркер5));
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресМаркер6) Тогда
		ТекущийОбъект.ПешийСОреолом=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресМаркер6));
	КонецЕсли;

	
КонецПроцедуры


&НаКлиенте
Процедура АдресМаркер3Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗагрузитьИзображение(АдресМаркер3);

КонецПроцедуры

&НаКлиенте
Процедура АдресМаркер4Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗагрузитьИзображение(АдресМаркер4);

КонецПроцедуры

&НаКлиенте
Процедура АдресМаркер5Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗагрузитьИзображение(АдресМаркер5);

КонецПроцедуры

&НаКлиенте
Процедура АдресМаркер6Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗагрузитьИзображение(АдресМаркер6);

КонецПроцедуры
